//
// This is a template configuration file for War Worlds server. You will have to customize
// it for your own setup, hopefully the comments help with that.
//
{
  "dataDirectory": "/path/to/data", // path to the data directory
  "configDirectory": "/path/to/config", // config files go here.
  "realmName": "Blitz", // name of the realm we're accepting requests for
  "listenPort": 8080, // port to listen for HTTP connections on

  // path to directory where we save request stats.
  "requestStatsDirectory": "/path/to/request/stats/directory",

  // The number of star simulation threads to run, set to 0 to disable star simulations.
  "numStarSimulationThreads": 1,

  // If true, we'll allow non-prod clients to log in. By default, only the prod client (from the
  // Play Store) is allowed to log in.
  "allowNonProdClientLogins": false,

  // Database configuration
  "database": {
    "server": "localhost",
    "port": 5432,
    "database": "wwmmo",
    "username": "wwmmo_user",
    "password": "********",
    "schema": "beta"
  },

  // Various limits you can apply to the game, mostly to combat player griefing, etc.
  "limits": {
    // maximum length of an empire name, in unicode characters
    "maxEmpireNameLength": 40,

    // maximum length an alliance name can be, in unicode characters
    "maxAllianceNameLength": 80,

    // maximum length a star name can be.
    "maxStarName": 40,

    // maximum ratio of emojis:text in chat messages, only counted if the message is > 8 characters
    // long (which would allow you to send an all-emoji message if it consisted of <= 4 emojis).
    // 20% is the default.
    "maxEmojiRatio": 0.2,
  },

  // Configuration related to empire resets.
  "resets": {
    // Reset period, We'll only lets you do maxResetsPerPeriod in this number of days.
    "resetPeriodDays": 14,

    // Maximum number of resets we'll allow within resetPeriodDays days.
    "maxResetsPerPeriod": 2
  },

  // Patreon config. Populate from https://www.patreon.com/portal/registration/register-clients
  "patreon": {
    "clientId": "",
    "clientSecret": "",
    "redirectUri": ""
  },

  // A list of auto-clicker that, if the user has installed on their device, we will reject
  // connections from.
  "clickers": [
    {
      // Name is the component name of the clicker's accessibility service. appName is the name
      // we display to the end user as the reason they've been kicked out.
      "name": "simplehat.clicker/simplehat.automaticclicker.services.AccessibilityService",
      "appName": "QuickTouch - Automatic Clicker"
    }
  ],

  // Configration describing how we handle SafetyNet attestation.
  "safetyNet": {
    // If false, we ignore safetynet attestation entirely.
    "enabled": false,

    // A list of empires for which we allow to log in even if they fail attestation.
    "exemptedEmpires": [322]
  }
}